# ~/dotfiles/Brewfile

# Environment setup
brew "stow"
brew "fish"
brew "age"
brew "shellcheck"
brew "pipx"
brew "uv"
brew "mas"

# Core replacements
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "micro"

# Workflow enhancements
brew "fnm"
brew "fzf"
brew "zoxide"
brew "lazygit"
brew "lefthook"

# Prompt and Multiplexer
brew "starship"
brew "zellij"

# GitHub CLI
brew "gh"

# GUI Applications (Casks)
cask "font-jetbrains-mono-nerd-font"
cask "zed"
cask "tabby"
cask "sublime-text"
cask "cursor"
cask "visual-studio-code"
cask "vlc"

# Mac App Store Applications
mas "KeepSolid VPN Unlimited", id: 694633015
